# vsoAddWidget

## Description
Add a widget of the specified type and localized name to appear in the Object Info Palette.

```pascal
FUNCTION vsoAddWidget(
				widgetID   : LONGINT;
				widgetType : LONGINT;
				locName    : STRING): BOOLEAN;
```

```python
def vs.vsoAddWidget(widgetID, widgetType, locName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT|   |
|widgetType|LONGINT|   |
|locName|STRING|   |

## Version
Availability: from Vectorworks 2014

## Category
* Object Events